import sys

synergy_list = [0 for _ in range(24)] # 알고리즘 돌아갈 때 사용할 현재 켜진 시너지 수
synergy_len_list = [0 for _ in range(24)] # 시너지별 브론즈 활성화에 필요한 수
synergy_unit_list = [['아무무', '녹턴', '블리츠크랭크', '코그모', '말자하'], ['아무무', '다리우스', '벤더', '블라디미르', '스카', '가렌'], [], ['파우더', '트런들', '직스', '갱플랭크', '코르키', '에코', '럼블'], ['파우더', '카밀', '스미치', '에코', '징크스'], ['다리우스', '드레이븐', '렐', '스웨인', '암베사', '모데카이저'], ['드레이븐', '바이올렛', '우르곳', '갱플랭크', '바이', '세비카'], ['스텝', '메디', '카밀', '로리스', '트위스티드페이트', '바이', '케이틀린'], ['스텝', '트런들', '세트', '레니', '누누와윌럼프', '엘리스'], ['이렐리아', '벡스', '아칼리', '세트', '이즈리얼', '일라오이', '조이', '징크스'], ['이렐리아', '신지드', '레오나', '렐', '로리스', '일라오이', '럼블'], ['럭스', '레오나', '이즈리얼', '하이머딩거', '제이스'], ['럭스', '자이라', '블라디미르', '나미', '스웨인', '조이', '르블랑'], ['모르가나', '블 라디미르', '카시오페아', '엘리스', '르블랑'], ['모르가나', '벡스', '렐', '레나타글라스크', '누누와윌럼프', '하이머딩거', '말자하'], ['메디', '제리', '코그모', '트위치', '케이틀린'], ['신지드', '레나타글라스크', '레니', '스미치', '실코', '세비카'], ['자이라', '우르곳', '누누와윌럼프', '문도박사', '트위치'], ['아칼리', '녹턴', '트위스티드페이트', '암베사'], ['트리스타나', '나미', '암베사', '가렌'], ['트리스타나', '우르곳', '이즈리얼', '코르키'], ['제리', '스카', '에코'], ['직스', '블리츠크랭크', '카시오페아', '문도박사', '실코', '모데카이저'], ['갱플랭크', '스웨인', '엘리스', '제이스']]

for x in range(60):
    index, lists, name = input().split()
    lists = lists.lstrip('[').rstrip(']').split(',')
    for i in lists:
        synergy_unit_list[int(i)].append(name)
print(synergy_unit_list)
for x in synergy_unit_list:
    print(x)